
unsigned short _804a024[1024] = 
{ 0, 156, 242, 300, 344, 379, 408, 432, 454, 472, 489, 504, 518, 530, 542, 553, 563, 572, 581, 589, 597, 604, 611, 617, 624, 630, 636, 641, 646, 651, 656, 661, 665, 670, 674, 678, 682, 686, 690, 693, 697, 700, 703, 707, 710, 713, 716, 719, 722, 724, 727, 730, 732, 735, 737, 740, 742, 744, 747, 749, 751, 753, 755, 757, 759, 761, 763, 765, 767, 769, 771, 772, 774, 776, 778, 779, 781, 783, 784, 786, 787, 789, 790, 792, 793, 795, 796, 797, 799, 800, 802, 803, 804, 806, 807, 808, 809, 811, 812, 813, 814, 815, 816, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 842, 843, 844, 845, 846, 847, 848, 848, 849, 850, 851, 852, 852, 853, 854, 855, 856, 856, 857, 858, 859, 859, 860, 861, 861, 862, 863, 864, 864, 865, 866, 866, 867, 868, 868, 869, 870, 870, 871, 871, 872, 873, 873, 874, 875, 875, 876, 876, 877, 878, 878, 879, 879, 880, 880, 881, 882, 882, 883, 883, 884, 884, 885, 885, 886, 887, 887, 888, 888, 889, 889, 890, 890, 891, 891, 892, 892, 893, 893, 894, 894, 895, 895, 896, 896, 896, 897, 897, 898, 898, 899, 899, 900, 900, 901, 901, 901, 902, 902, 903, 903, 904, 904, 904, 905, 905, 906, 906, 907, 907, 907, 908, 908, 909, 909, 909, 910, 910, 911, 911, 911, 912, 912, 913, 913, 913, 914, 914, 914, 915, 915, 916, 916, 916, 917, 917, 917, 918, 918, 918, 919, 919, 919, 920, 920, 921, 921, 921, 922, 922, 922, 923, 923, 923, 924, 924, 924, 925, 925, 925, 925, 926, 926, 926, 927, 927, 927, 928, 928, 928, 929, 929, 929, 930, 930, 930, 930, 931, 931, 931, 932, 932, 932, 933, 933, 933, 933, 934, 934, 934, 935, 935, 935, 935, 936, 936, 936, 936, 937, 937, 937, 938, 938, 938, 938, 939, 939, 939, 939, 940, 940, 940, 941, 941, 941, 941, 942, 942, 942, 942, 943, 943, 943, 943, 944, 944, 944, 944, 945, 945, 945, 945, 946, 946, 946, 946, 946, 947, 947, 947, 947, 948, 948, 948, 948, 949, 949, 949, 949, 950, 950, 950, 950, 950, 951, 951, 951, 951, 952, 952, 952, 952, 952, 953, 953, 953, 953, 954, 954, 954, 954, 954, 955, 955, 955, 955, 955, 956, 956, 956, 956, 956, 957, 957, 957, 957, 957, 958, 958, 958, 958, 958, 959, 959, 959, 959, 959, 960, 960, 960, 960, 960, 961, 961, 961, 961, 961, 962, 962, 962, 962, 962, 963, 963, 963, 963, 963, 963, 964, 964, 964, 964, 964, 965, 965, 965, 965, 965, 965, 966, 966, 966, 966, 966, 966, 967, 967, 967, 967, 967, 968, 968, 968, 968, 968, 968, 969, 969, 969, 969, 969, 969, 970, 970, 970, 970, 970, 970, 971, 971, 971, 971, 971, 971, 972, 972, 972, 972, 972, 972, 972, 973, 973, 973, 973, 973, 973, 974, 974, 974, 974, 974, 974, 975, 975, 975, 975, 975, 975, 975, 976, 976, 976, 976, 976, 976, 976, 977, 977, 977, 977, 977, 977, 978, 978, 978, 978, 978, 978, 978, 979, 979, 979, 979, 979, 979, 979, 980, 980, 980, 980, 980, 980, 980, 981, 981, 981, 981, 981, 981, 981, 981, 982, 982, 982, 982, 982, 982, 982, 983, 983, 983, 983, 983, 983, 983, 983, 984, 984, 984, 984, 984, 984, 984, 985, 985, 985, 985, 985, 985, 985, 985, 986, 986, 986, 986, 986, 986, 986, 986, 987, 987, 987, 987, 987, 987, 987, 987, 988, 988, 988, 988, 988, 988, 988, 988, 989, 989, 989, 989, 989, 989, 989, 989, 989, 990, 990, 990, 990, 990, 990, 990, 990, 991, 991, 991, 991, 991, 991, 991, 991, 991, 992, 992, 992, 992, 992, 992, 992, 992, 992, 993, 993, 993, 993, 993, 993, 993, 993, 993, 994, 994, 994, 994, 994, 994, 994, 994, 994, 995, 995, 995, 995, 995, 995, 995, 995, 995, 996, 996, 996, 996, 996, 996, 996, 996, 996, 996, 997, 997, 997, 997, 997, 997, 997, 997, 997, 997, 998, 998, 998, 998, 998, 998, 998, 998, 998, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1001, 1001, 1001, 1001, 1001, 1001, 1001, 1001, 1001, 1001, 1002, 1002, 1002, 1002, 1002, 1002, 1002, 1002, 1002, 1002, 1002, 1003, 1003, 1003, 1003, 1003, 1003, 1003, 1003, 1003, 1003, 1003, 1004, 1004, 1004, 1004, 1004, 1004, 1004, 1004, 1004, 1004, 1004, 1005, 1005, 1005, 1005, 1005, 1005, 1005, 1005, 1005, 1005, 1005, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1006, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1007, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1008, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1009, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1010, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1011, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1012, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1013, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1014, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1015, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1016, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1017, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1018, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1019, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1020, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1021, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1022, 1023, 1023, 1023, 1023, 1023, 1023, 1023, 1023, 1023, 1023 };

struct {
  unsigned char _0;
} _20001e3e;


void func_0x8022f48() {
  _20001e3e._0 = 0;
}

typedef struct _20001fd4 {
  unsigned char a; // 0
  unsigned char b; 
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g; // 6
  unsigned char h;
  unsigned char i; // 8 
  unsigned char j;
  unsigned char k; // 10
  unsigned char l;
  unsigned char m; // 12
  unsigned char n;
  unsigned char o; // 14
  unsigned char p;
  unsigned char q; // 16
  unsigned char r;
  unsigned char s; // 18
  unsigned char t;
  unsigned char u; // 20
  unsigned char v;
  unsigned char w; // 22
  unsigned char x;
  unsigned char y; // 24
  unsigned char z;
  unsigned char aa; // 26
  unsigned char ab;
  unsigned char ac; // 28
  unsigned char ad;
  unsigned char ae; // 30
  unsigned char af;
  unsigned char ag; // 32
  unsigned char ah;
  unsigned char ai; // 34
  unsigned char aj;
  unsigned char ak; // 36
  unsigned char al;
  unsigned char am; // 38
  unsigned char an;
  unsigned char ao; // 40
  unsigned char ap;
  unsigned char aq; // 42
  unsigned char ar; 
} _20001fd4;

_20001fd4 voice_arr[8];

typedef struct {
  unsigned short _0; // 0x0
  unsigned short _01; // 0x0
  unsigned int _1; // 0x4
  unsigned int _2; // 0x8
  unsigned int _3; // 0xc
} _2000055c_mem;

_2000055c_mem _2000055c;
_2000055c_mem _200000bc;
_2000055c_mem _20000b68;
int * _20001a18;
int * _20001e68[32];
unsigned short _2000583c[112];
unsigned char _2000a96d[17];
unsigned short _2000ae4c[112];

struct {
  unsigned char a; // 0 
  unsigned char b; // 1
  unsigned char bank_number; // 2
  unsigned char d; // 3
  unsigned char e; // 4
  unsigned char f;
  unsigned char patch_number; // 6

} _20000f28;

int func_0x8027f30() {
  return _20000f28.e;
}

typedef struct {
  int * curr;
  int * next;

} _8020b94;

typedef struct {
  int a; // 0
  int b; // 4
  _8020b94 * c; // 8
  int d; // 12
  int e; // 16
  int f; // 20
  int g; // 24
  int h; // 28
  int i; // 32
  int j; // 36
  int k; // 40
  int l; // 44
  int m; // 48
  int n; // 52
  int o; // 56
  int p; // 60

} _8020400;



typedef struct {
  unsigned char a; // 0
  unsigned char b;
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g; // 6
  unsigned char h;
  unsigned char i; // 8
  unsigned char j;
  unsigned char k; // 10
  unsigned char l;
  unsigned char m; // 12
  unsigned char n; // 13
  unsigned char o; // 14
  unsigned char p; // 15

} _20004afc_mem;

/*typedef struct {*/

/*} _20004afc_mem;*/

_20004afc_mem _20004afc[82];

/*_2000583c_mem _2000ae4c[112];*/

int * _200088bc;

int _200098e4;


int func_0x8027cdc(int, int);

// check hardware version, check GPIO_C port 15 for on/off
int func_0x8027d1c() {
  return func_0x8027cdc(0x40020800, 32768);
}

typedef struct {
  unsigned char a; // 0
  unsigned char b; // 1
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g;
  unsigned char h;
  unsigned char i; // 8
  unsigned char j;
  unsigned char k;
  unsigned char l;
  unsigned char m; // 12
  unsigned char n;
  unsigned char o;
  unsigned char p;
  unsigned char q; // 16
  unsigned char r;
  unsigned char s;
  unsigned char t;
  unsigned char u; // 20
  unsigned char v;
  unsigned char w; // 22
  unsigned char x;
  unsigned char y; // 24
  unsigned char z; // 25
  unsigned char aa; // 26
  unsigned char ab; 
  unsigned char ac; // 28
  unsigned char ad;
  unsigned char ae; // 30
  unsigned char af;
  unsigned char ag; // 32
  unsigned char patch_number; // 33
  unsigned char aj;
  unsigned char ak;

} _2000a99e_mem;

_2000a99e_mem _2000a99e;

unsigned char _2000a99e_arr[40];
unsigned char  _2000a91c[82];
_2000a99e_mem _2000a9ca[10];

struct {
  unsigned char a; // 0
  unsigned char b; // 1
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g; // 6
  unsigned char h;
  unsigned char i; // 8
  unsigned char j;
  unsigned char k; // 10
  unsigned char l;
  unsigned char m; // 12
  unsigned char n;
  unsigned char o; // 14
  unsigned char p;
  unsigned char q; // 16
  unsigned char r;
  unsigned char s; // 18
  unsigned char t;
  unsigned char u; // 20
  unsigned char v; 
  unsigned char w; // 22 
  unsigned char x; 
  unsigned char y; // 24
  unsigned char z; 
  unsigned char aa; // 26
  unsigned char ab; 
  unsigned char ac; // 28
  unsigned char ad;
  unsigned char ae; // 30
  unsigned char af;
  unsigned char ag; // 32
  unsigned short ZZZ[1024]; // 33
  unsigned short YYY[1024]; // 1056
  unsigned short XXX[1024]; // 2080

} _20001120;
/* *(((0x20001120 + 2080) + p1 * 2));*/

unsigned char func_0x80280b0() {
  return _20001120.a;
}


struct {
  unsigned char a; // 0
  unsigned char b; // 1
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g;
  unsigned char h;
  unsigned char i; // 8
  unsigned char j; // 9
  unsigned char k; // 10
  unsigned char l; // 11
  unsigned char m; // 12
  unsigned char n; // 13
  unsigned char o; // 14
  unsigned char p; // 15
  unsigned char q; // 16
  unsigned char r; // 17
  unsigned char s; // 18
  unsigned char t; // 19
  unsigned char u; // 20
  unsigned char v; 
  unsigned char w; // 22
  unsigned char x; 
  unsigned char y; // 24
  unsigned char z; 
  unsigned char aa;  // 26
  unsigned char ab; 
  unsigned char ac; // 28
  unsigned char ad; 
  unsigned char ae; // 30
  unsigned char af; 
  float ag[112]; // 32, tuning?
} _20000f30;

void func_0x8032040() {
  if (_20001120.d != 0) {
    _20001120.e = 0;
  } else {
    _20001120.d = 1;
    _20001120.e = 0;
  }
}

int func_0x802b9cc() {
  return _20000f30.o;
}

unsigned char func_0x802b9b4() {
  return _20000f30.b;
}

unsigned char func_0x802b9c0() {
  return _20000f30.e;
}
unsigned char func_0x802b294() {
  return _20000f30.t;
}

/*unsigned char func_0x802b294() {*/
  /*return _20000f30.n;*/
/*}*/

unsigned char func_0x802b908() {
  return _20000f30.k;
}

typedef struct spi_struct {
  int data_reg; // + 8
  int status_reg; // + 12
} SPI;

SPI * SPI1;















/* Memory section */



struct {
  unsigned char locked;
} spi1_lock;

void func_0x8027cea(int, int);
void func_0x8027cee(int, int);

int func_0x80304d4(int device, int state) {
  int r4 = 0x40013000; // TODO: SPI * SPI1
  int r3 = 0x40020400; // TODO: GPIO * GPIO_B
  if (state == 0) {
    spi1_lock.locked = 0;
    if (device == 1) {
      func_0x8027cee(0x40020400, 0x40020400 >> 22);
    } else {
      func_0x8027cee(0x40020400, 512);
      // *(0x40013000 + 0) = (*(0x40013000 + 0)) | 48;
    }
    return 1;
  } else {
    if (spi1_lock.locked) {
      return 0;
    } else {
      spi1_lock.locked = 1;
      if (device == 1) {
        func_0x8027cea(0x40020400, 1 << 8);
      } else {
        // *(0x40013000 + 0) = (*(0x40013000 + 0)) & (~56);
        func_0x8027cea(0x40020400, 512);
      }
      return 1;
    }
  }
}

void func_0x802fb94(SPI * SPI1, int p1) {
  SPI1->status_reg = p1;
}

int func_0x802fb90(SPI * SPI1) {
  return SPI1->status_reg;
}

int func_0x802fb82(SPI * SPI1, int p2) {
  if (SPI1->data_reg != p2) { return 1; } else { return 0; }
}

int func_0x8030668(int p1) // send and recv byte SPI1
{
  // wait for SPI1 to be ready
  while (func_0x802fb82(SPI1, 2) != 0){ }
  
  // send SPI1
  func_0x802fb94(SPI1, p1); 
  
  // wait for SPI1 to be ready
  while (func_0x802fb82(SPI1, 1) != 0) { }

  return func_0x802fb90(SPI1); // read SPI1
}

int func_0x8030634(int p1) {
  while (func_0x802fb82(SPI1, 2) != 0) { }

  func_0x802fb94(SPI1, p1);
  while (func_0x802fb82(SPI1, 1) != 0) { }
  return func_0x802fb90(SPI1);
}

int func_0x80305f8() {

  int out;
  
  while (func_0x80304d4(0, 1) != 0) { }

  func_0x8030668(5);
  func_0x8030634(0);
  out = (unsigned int) func_0x8030634(0);

  func_0x80304d4(0, 0);

  while (func_0x802fb82(SPI1, 128) != 1) { }

  return out;
}

int func_0x8030590() { return func_0x80305f8() & 1; }

void func_0x80306d4() {
  // wait for SPI1 to unlock
  while (func_0x80304d4(0, 1) != 0) { }

  func_0x8030668(6);
  func_0x80304d4(0, 0); // switch SPI1 back down

  while (func_0x802fb82(SPI1, 128) != 1) { }
  while (func_0x8030590() == 0) { }
}



void func_0x803069c() {
  while (func_0x80304d4(0, 1) != 0) { }
  func_0x8030668(4);
  func_0x80304d4(0, 0);

  while (func_0x802fb82(SPI1, 128) != 1) { }
  while (func_0x8030590() == 0) { }

  return;
}

void func_0x803070c(int p1, int p2)
{
  func_0x80306d4();

  while (func_0x80304d4(0, 1) != 0) {}

  func_0x8030668(2);
  func_0x8030668(p1 & 0xff0000);
  func_0x8030668(p1 & 0xff00);
  func_0x8030668((unsigned char) p1);
  func_0x80304d4(0, 0);
  
  while (func_0x802fb82(SPI1, 128) != 1) {}
  while  (func_0x8030590() == 0) {}

}

void func_0x8030540(int p1) {
  while (func_0x80304d4(0, 1) != 0) { }
  
  func_0x8030668(32);
  func_0x8030668((p1 << 12) & 0xff0000);
  func_0x8030668((p1 << 12) & 0xff00);
  func_0x8030668((unsigned int) (p1 << 12));
  func_0x80304d4(0, 0);
  
  while (func_0x802fb82(SPI1, 128) != 1) { }
  while (func_0x8030590() == 0) { }
}


// TODO this got annotated incorrectly and part is missing
void func_0x8030890(int p1, _2000a99e_mem * p2, int p3) {
  /*r7 = p1;*/
  /*r5 = p2;*/
  /*r6 = p3;*/
  int i = 0;
  while (func_0x80304d4(0, 1) != 0) { }
 
  func_0x8030668(3);
  func_0x8030668(p1 & 0xff0000);
  func_0x8030668(p1 & 0xff00);
  func_0x8030668((unsigned int) p1);
  if (0 < p3) {
    while(1) {
      /*
      0x80308c8 2 0020 movs r0, 0
      0x80308ca 4 fff7b3fe bl 0x8030634
      0x80308ce 2 2855 strb r0, [r5, r4]
      0x80308d0 2 641c adds r4, r4, 1
      0x80308d2 2 b442 cmp r4, r6
      0x80308d4 2 f8d3 bcc.n 0x80308c8
      */
      *(p2 + i) = func_0x8030634(0);
      i = i + 1;
      if (i >= p3) { break; }
    }
  }
  func_0x80304d4(0,0);
  while (func_0x802fb82(SPI1, 128) != 0) { }
}


void func_0x8030926(int p1, unsigned char * p2, int p3) {
  int i = 0;
  func_0x80306d4();
  if (p3 > 0) {
    while (1) {
      func_0x803070c(p1, *(p2 + i));
      p1++;
      i++;
      if (i >= p3) { break; }
    }
  }
  func_0x803069c();
}

/* End memory section */










/* screen stuff */

struct {
  unsigned short a;
  unsigned short b;

} _20001a38;

void func_0x802ff6c(int p1, int p2) {
  _20001a38.a = p1;
  _20001a38.b = p2;
}


void func_0x802fe84(int p1, int p2, int p3) ; //{
  /*if (p1 < 128 && p2 < 64) {*/
    /*if ((*(0x20001a38 + 4)) != 0) {*/
      /*if (p3 != 0) { p3 = 0; }*/
      /*else { p3 = 1; }*/

    /*}*/

    /*r4 = 1;*/
    /*r3 = r1 & 7;*/
    /*r3 = 1 << (r1 & 7);*/
    /*r1 = r1 >> 3;*/
    /*ip = 0x20001a30;*/
    /*r0 = r0 + ((r1 >> 3) << 7);*/
    /*cond0 = r2 != 1;*/
    /*if (cond0)*/
    /*{*/
      /*r1 = *(0x20001a30 + 4);*/
      /*var0 = *((*(0x20001a30 + 4)) + (r0 + ((r1 >> 3) << 7)));*/
      /*var1 = var0 & (~(1 << (r1 & 7)));*/
      /**((*(0x20001a30 + 4)) + (r0 + ((r1 >> 3) << 7))) = var1;*/
      /*return;*/
    /*}*/
    /*else*/
    /*{*/
      /*r1 = *(0x20001a30 + 4);*/
      /*var2 = *((*(0x20001a30 + 4)) + (r0 + ((r1 >> 3) << 7)));*/
      /*r2 = var2 | (1 << (r1 & 7));*/
      /**((*(0x20001a30 + 4)) + (r0 + ((r1 >> 3) << 7))) = var2 | (1 << (r1 & 7));*/
      /*return;*/
    /*}*/

  /*}*/
  /*else*/
  /*{*/
    /*return;*/
  /*}*/

/*}*/

// computes the length or width or something 
int func_0x8021a9c(int * p1, int p2, unsigned int p3); //{
  /*unsigned int r3 = 0;*/
  /*if (*p1 != 0) {*/
    /*while (1) {*/
      /*var0 = *(0x20001a20 + 4) + ((*p1 - 32) << 7);*/
      /*r4 = *(var0 + 0);*/
      /*r3 += r4 + 1;*/
      /*p1++;*/
      /*if (*p1 == 0) { break; }*/
    /*}*/
  /*}*/
  /*// TODO label this formula*/
  /*// var3 = p3 - r3 - 1 + sign(p3 - r3 - 1)*/
  /*var3 = (p3 - ((unsigned int) (r3 - 1))) + ((p3 - ((unsigned int) (r3 - 1))) >> 31);*/
  /*return (unsigned int) (p2 + (var3 >> 1));*/
/*}*/



int func_0x8030200(int p1, int p2, int p3); //{
  /*sp = sp - 8;*/
  /*sl = p2;*/
  /*r9 = p3;*/
  
  /**(sp + 4) = (*(sp + 8)) - 32;*/
  
  /*var0 = (*(p2 + 4)) + (((*(sp + 8)) - 32) << 7);*/
  /*cond1 = ((*0x20001a38) + (*(var0 + 0))) < 128;*/
  /*cond0 = ((*(0x20001a38 + 2)) + 24) >= 64;*/
  /*if (cond1 && (~cond0)) {*/
    /*r0 = (unsigned int) (*(var0 + 0));*/
    /**(sp + 0) = (unsigned int) (*(var0 + 0));*/
    /*if (*(sp + 0) > 0) {*/
      /*r5 = 0;*/
      /*r1 = *(sp + 4);*/
      /*r0 = 0 + (0 << 1);*/
      /*var1 = (0 + (0 << 1)) + ((*(sp + 4)) << 6);*/
    /*}*/

    /**0x20001a38 = *0x20001a38 + *p2;;*/
    /*return *(sp + 8);*/
  /*} else {*/
    /*return 0;*/
  /*}*/

/*}*/

// TODO clean further
int func_0x803040a(int r0, int r1, int * r2, int r3);
/*{*/
  /*r5 = p1;*/
  /*r7 = *(sp + 24);*/
  /*r8 = p2;*/
  /*r4 = p3;*/
  /*r6 = p4;*/
  /*r0 = *(r2 + 0);*/
  /*cond0 = (*(r2 + 0)) != 0;*/
  /*if (cond0) {*/
    /*while (1) {*/
      /*func_0x802ff6c(r5, r8);*/
      /*r0 = func_0x8030200(*(r4 + 0), r6, r7);*/
      /*r2 = *(r4 + 0);*/
      /*cond0 = func_0x8030200(*(r4 + 0), r6, r7) != (*(r4 + 0));*/
      
      /*if (cond0) { return *(r4 + 0); }*/

      /*r0 = *(r6 + 4);*/
      /*r1 = (*(r4 + 0)) - 32;*/
      /*r0 = (*(r6 + 4)) + (((*(r4 + 0)) - 32) << 7);*/
      /*r1 = r5 + 3;*/
      /*r0 = *(var0 + 0);*/
      /*r0 = (*(var0 + 0)) + (r5 + 3);*/
      /*r5 = (unsigned int) ((*(var0 + 0)) + (r5 + 3));*/
      /*r4 = r4 + 1;*/
      /*if (*((r4 + 1) + 0) == 0) { break; }*/
    /*}*/
  /*} else {*/
    /*return *(r2 + 0);*/
  /*}*/

/*}*/

void func_0x802fd58(int p1, int p2, int p3, int p4)
{
  int * sp = sp - 8;
  int r0, sl, fp, r5, r8, r9;
  /*r5 = p1;*/
  /*r4 = p2;*/
  /*r6 = p3;*/
  /*r7 = p4;*/
  if (p1 > 127) { p1 = 127; }
  if (p3 > 127) { p3 = 127; }
  if (p2 > 63) { p2 = 63; }
  if (p4 > 63) { p4 = 63; }

  if (p1 < p3) { r0 = p3 - p1; }
  else { r0 = p1 - p3; }
  sl = (int) r0;
  
  if (p2 < p4) { r0 = p4 - p2; }
  else { r0 = p2 - p4; }
  r9 = (int) r0;
  
  if (p1 < p3) { r0 = 1; }
  else { r0 = -1; }
  *(sp + 0) = r0;
  
  if (p2 < p4) { fp = 1; }
  else { fp = -1; }

  if (sl > r9) { r0 = (int) p1; }
  else { r0 = 0 - r9; }
  r0 = r0 + (r0 >> 31);
  r0 = (r0 + (r0 >> 31)) >> 1;
  r8 = (int) ((r0 + (r0 >> 31)) >> 1);

  if (sl != 0) {
    if ( r9 != 0) {
      r0 = 0 - sl;
      *(sp + 4) = sl;

      while (1) {
        func_0x802fe84(p1, p2, *(sp + 44));
        if (p1 != p3) {
          if (r8 > *(sp + 4)) {
            r8 = (int) (r8 - r9);
            p1 = (unsigned int) ((*(sp + 0)) + p1);
          } else {
            if (r8 < r9) {
              r8 = (int) (r8 + sl);
              p2 = (unsigned int) (p2 + fp);
            }
          }
        }
        if (p2 != p4) { break; }
      }

    } else {
      if (p4 < p2) { p2 = (unsigned int) p4; }

      if (p3 < p1) {
        r0 = p3;
        p3 = p1;
        p1 = (unsigned int) r0;
      }

      if ( p1 <= p3 ) {
        while (p1 <= p3) {
          func_0x802fe84(p1, p2, *(sp + 44));
          p1++;
        }
      }
      return;
    }
  } else {
    if (p4 < p2) { r0 = p4; p4 = p2; p2 = (unsigned int) r0; }

    if (p3 < p1) { p1 = (unsigned int) p3; }

    p2 = (int) p2;
    if ((int) p2 <= p4) {
      while (p2 <= p4) {
        func_0x802fe84(r5, (unsigned int) p2, *(sp + 44));
        p2++;
      }
    }
  }
}

// Draw a rectangle?
void func_0x802fc34(unsigned int p1, unsigned int p2, unsigned int p3, unsigned int p4) {
  int i = 0;
  int * sp;
  if (p1 < 128 && p2 < 64) {
    if ((p1 + p3) >= 128) { p3 = (unsigned int) (p1 - 128); }
    if ((p2 + p4) >= 64) { p4 = (unsigned int) (p2 - 64); }
    while (1) {
    // for (int i = 0; i++; i < p4) {
      *sp = *(sp + 32);
      func_0x802fd58(p1, (unsigned int) (p2 + i), (unsigned int) p1 + p3, (unsigned int) (p2 + i));
      i++;
      if (i > p4) { break; }
    }
  }
  return;
}

/* end screen stuff */
























void func_0x8036506(int, int);

void func_0x8031e8c(unsigned char patch_number) {
  if (patch_number >= 128) { patch_number = 127; }
  if (patch_number <= 0) { patch_number = 1; }

  _20000f28.patch_number = patch_number;

  func_0x8036506(0x40002000, 0); // turn off timer 14
  func_0x8030890(520192, &_2000a99e, 44); // copy 11 words from FAT disk start
  _2000a99e.patch_number = patch_number;
  func_0x80306d4();
  func_0x8030540(127); //, _20000f28.patch_number );
  func_0x8030926(520192, &_2000a99e_arr[0], 44);
  func_0x8036506(0x40002000, 1);
  return;
}

// TODO: decode with blx 
int func_0x8020400(_8020400 * p1, _8020b94 * p2);
/*{*/
  /*sl = 0;*/
  /*r9 = p2;*/
  /*r4 = p1;*/
  /**(p1 + 32) = 0;*/
  /*while (1) {*/
    /*r1 = *(p1 + 12);*/
    /*if (p1 != 0) {*/
      /*if (p1 != 37) {*/
        /*r2 = *(p1 + 4);*/
        /*r1 = *((p1 + 4) + 4);*/
        /**(p1 + 32) = (*(p1 + 32)) + 1;*/
      /*} else {*/
        /*r1 = *(r4 + 12);*/
        /*r5 = 0;*/
        /**(p1 + 28) = sl;*/
        /*r6 = p1;*/
        /*r7 = 0;*/
        /**(p1 + 24) = sl;*/
      /*}*/

    /*}*/
    /*else*/
    /*{*/
      /*r0 = *(p1 + 32);*/
      /*return;*/
    /*}*/

    /*cond0 = r6 != 0;*/
    /*if (cond0)*/
    /*{*/
      /*break;*/
    /*}*/

  /*}*/

/*}*/

// TODO solve stack magic
/*int func_0x8020b6e(int p1, int * p2, int * p3, int p4) {*/
int func_0x8020b6e(int p1, _8020b94 * p2, _8020b94 * p3, int p4) {
  // sp = sp - 60;
  _8020400 str;
  // *(sp + 4) = p4;
  str.b = p4;
  // *((sp + 4) + 4) = p2;
  str.c = p2;
  // *(sp + 20) = 0;
  str.f = 0;
  //*(sp + 12) = 0 // 0xffffffe5 + pc;
  str.d = 0 ; // 0xffffffe5 + pc;
  // *((sp + 12) + 4) = p1;
  str.e = p1;
  return func_0x8020400(&str, p3);
}


void func_0x8020b94(int p1, _8020b94 * p2) {
  int * prev = p2->curr;
  *(p2->curr + 1) = p1;
  p2->curr = prev;
  return;
}


// format string?
// TODO verify again
void func_0x802030c(int * p1, char * r1, int r2) { // TODO check args
  // thingy = *(sp + 20)
  int thingy;
  _8020b94 * sp;
  _8020b94 * v1 = sp + 24;
  int r3 = 0; // 0x87d + pc //  TODO figure out str
  sp->curr = p1;
  // r0 = *(sp + 20);
  func_0x8020b6e(thingy, sp, v1, r3); // TODO are these args right?
  func_0x8020b94(0, sp);
  // pc = *(sp + 20);
  // pc = *sp + 20;
}

/*int func_0x803c888(int ** p1, int * p2, int p3)*/
int func_0x803c888(int ** p1) {
  int r2;
  int ** ip = p1;
  int * r3 = *p1;
  if (*p1 != 0) {
    int * r1 = *p1;
    while (1) {
      if (*r1 < 32 || r2 == 58) { break; } else { r1++; }
    }

    if (*r1 != 58) {
      return 0;
    } else {
      int cond2 = ((*r3 + 1) - 48) <= 9;
      int cond1 = r3 == r1;
      r2 = (*(r3 + 1)) - 48;
      int cond0 = ((*(r3 + 1)) - 48) == 0;
      // TODO check these conditions
      if ((cond2 && cond1) && (~cond0)) {
        int r0 = (*(r3 + 1)) - 48;
        r1 = r1 + 1;
        *p1 = r1 + 1;
        return r0;
      } else {
        return -1;
      }
    }
  } else { return -1; }
}

int func_0x803ba7a(int p1) { // likely this USED to do something
  return 0;                  // also, fuck Roman Filipov
}

int func_0x803c340(int ** p1, int * p2, int p3) {
  /*sp = sp - 16;*/
  /*r6 = r1;*/
  /*r8 = r2;*/
  int r0, r1, r5;

  /*r7 = 0;*/
  *(p2 + 0) = 0;
  r5 = func_0x803c888(p1);
  if (r5 == 0) {
    return 11;
  }

  /*if ((*((0x20001e68 + r5) << 2)) == 0) {*/
  if (_20001e68[r5] == 0) { // == NULL
    return 12;
  }

  *(p2 + 0) = _20001e68[r5];
  r6 = p3 & 254;
  // Note leave these lines for later
  /*r0 = func_0x803ba7a(*((_20001e68[r5]) + 1));*/
  /*if (~(cond0) && ~(r0 & 1))*/
  if (*(_20001e68[r5] + 0) != 0) {
    // second condition also shouldn't matter here because r0 == 0
    /*if (p3 & 254 == 0 || (~((*((*((0x20001e68 + r0) << 2)) + 1)) & 4))) {*/
    if (((p3 & 254) == 0) || 1) {
      return 0;
    } else {
      // TODO verify unreachable
      return 10;
    }

  }

  *(_20001e68[r5] + 0) = 0;
  r0 = (unsigned int) r5;
  *(_20001e68[r5] + 1) = (unsigned int) r5;
  r0 = func_0x803ba5c();
  if (r0 & 1) {
    return 3;
  }

  if (((p3 & 254) != 0) && (r5 & 4)) {
    return 10;
  }

  r6 = 0;
  r0 = func_0x803afd0(_20001e68[r5], 0);
  if (r0 == 2) {
    r5 = 0;
    r8 = sp;
    while (r5 < 4) {
      r0 = r4 + (r5 << 4);
      r0 = (r4 + (r5 << 4)) + 502;
      r1 = *(((r4 + (r5 << 4)) + 502) + 4);
      var0 = *(((r4 + (r5 << 4)) + 502) + 4);
      if (var0 != 0) {
        var1 = ((r4 + (r5 << 4)) + 502) + 8;
        r0 = func_0x803cbba(var1);
      } else 
        r0 = 0;
      }

      *((r8 + r5) << lsl) = r0;
      r5 = r5 + 1;
    }

  }

  r5 = 0;
  while (1) {
    if ((*(p2 + (r5 << 2)) != 0)) {
      r0 = func_0x803afd0(r4, *(p2 + (r5 << 2));
    } else {
      r0 = 3;
    }
    r5 = r5 + 1;
    if ((r0 < 2) && (r5 > 4)) { break; }
  }

  if ((*((0x20001e68 + r0) << 2)) == 4)
  {
    sp = sp + 16;
    r0 = 1;
    return 1;
  }

  if (r0 >= 2)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = (*((0x20001e68 + r0) << 2)) + 67;
  func_0x803cbd0();
  ;
  if (((*((0x20001e68 + r0) << 2)) + 67) != 4096)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = (*((0x20001e68 + r0) << 2)) + 78;
  func_0x803cbd0();
  ;
  r1 = (*((0x20001e68 + r0) << 2)) + 78;
  if (((*((0x20001e68 + r0) << 2)) + 78) == 0)
  {
    r0 = (*((0x20001e68 + r0) << 2)) + 92;
    func_0x803cbba();
    ;
    r1 = (*((0x20001e68 + r0) << 2)) + 92;
  }

  *((*((0x20001e68 + r0) << 2)) + 32) = r1;
  r0 = *((*((0x20001e68 + r0) << 2)) + 72);
  *((*((0x20001e68 + r0) << 2)) + 2) = *((*((0x20001e68 + r0) << 2)) + 72);
  if (((*((*((0x20001e68 + r0) << 2)) + 72)) != 1) || ((*((*((0x20001e68 + r0) << 2)) + 72)) != 2))
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r8 = r0 * r1;
  r0 = *((*((0x20001e68 + r0) << 2)) + 69);
  *((*((0x20001e68 + r0) << 2)) + 10) = *((*((0x20001e68 + r0) << 2)) + 69);
  var2 = (*((*((0x20001e68 + r0) << 2)) + 69)) - 1;
  if (((*((*((0x20001e68 + r0) << 2)) + 69)) == 0) && ((*((*((0x20001e68 + r0) << 2)) + 69)) & var2))
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = (*((0x20001e68 + r0) << 2)) + 73;
  func_0x803cbd0();
  ;
  *((*((0x20001e68 + r0) << 2)) + 8) = (*((0x20001e68 + r0) << 2)) + 73;
  if (((*((0x20001e68 + r0) << 2)) + 73) & 127)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = (*((0x20001e68 + r0) << 2)) + 75;
  func_0x803cbd0();
  ;
  r5 = (*((0x20001e68 + r0) << 2)) + 75;
  r0 = (*((0x20001e68 + r0) << 2)) + 75;
  if (((*((0x20001e68 + r0) << 2)) + 75) != 0)
  {
    r0 = (*((0x20001e68 + r0) << 2)) + 88;
    func_0x803cbba();
    ;
    r5 = (*((0x20001e68 + r0) << 2)) + 88;
  }

  r0 = (*((0x20001e68 + r0) << 2)) + 70;
  func_0x803cbd0();
  ;
  r2 = (*((0x20001e68 + r0) << 2)) + 70;
  if (((*((0x20001e68 + r0) << 2)) + 70) == 0)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r3 = *((*((0x20001e68 + r0) << 2)) + 8);
  var3 = ((*((0x20001e68 + r0) << 2)) + 70) + (r0 * r1);
  var4 = var3 + ((*((*((0x20001e68 + r0) << 2)) + 8)) >> 7);
  if (r5 < var4)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  ip = *((*((0x20001e68 + r0) << 2)) + 10);
  r0 = r5 - var4;
  var5 = (r5 - var4) / (*((*((0x20001e68 + r0) << 2)) + 10));
  if (var5 == 0)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r5 = 0;
  ip = 0xffffff5;
  if (r0 <= 0xffffff5)
  {
    r5 = 3;
  }

  ip = 65525;
  if (r0 <= 65525)
  {
    r5 = 2;
  }

  ip = 4085;
  if (r0 <= 4085)
  {
    r5 = 1;
  }

  if (r5 == 0)
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = r0 + 2;
  *((*((0x20001e68 + r0) << 2)) + 28) = r0 + 2;
  *((*((0x20001e68 + r0) << 2)) + 36) = r6;
  var6 = ((*((0x20001e68 + r0) << 2)) + 70) + r6;
  *((*((0x20001e68 + r0) << 2)) + 40) = var6;
  r1 = var4 + r6;
  *((*((0x20001e68 + r0) << 2)) + 48) = var4 + r6;
  if (r5 == 3)
  {
    r0 = (*((0x20001e68 + r0) << 2)) + 98;
    func_0x803cbd0();
    ;
    if (((*((0x20001e68 + r0) << 2)) + 98) != 0)
    {
      sp = sp + 16;
      r0 = 13;
      return 13;
    }

    r0 = *((*((0x20001e68 + r0) << 2)) + 8);
    if ((*((*((0x20001e68 + r0) << 2)) + 8)) != 0)
    {
      sp = sp + 16;
      r0 = 13;
      return 13;
    }

    r0 = (*((0x20001e68 + r0) << 2)) + 100;
    func_0x803cbba();
    ;
    *((*((0x20001e68 + r0) << 2)) + 44) = (*((0x20001e68 + r0) << 2)) + 100;
    r0 = *((*((0x20001e68 + r0) << 2)) + 28);
    var7 = (*((*((0x20001e68 + r0) << 2)) + 28)) << 2;
  }
  else
  {
    if ((*((*((0x20001e68 + r0) << 2)) + 8)) == 0)
    {
      sp = sp + 16;
      r0 = 13;
      return 13;
    }

    r1 = var6 + (r0 * r1);
    *((*((0x20001e68 + r0) << 2)) + 44) = var6 + (r0 * r1);
    if (r5 == 2)
    {
      r0 = r0 << 1;
    }
    else
    {
      r1 = r0 & 1;
      r0 = r0 + (r0 << 1);
      var8 = (r0 & 1) + ((r0 + (r0 << 1)) >> 1);
    }

  }

  r1 = *((*((0x20001e68 + r0) << 2)) + 32);
  r0 = r0 + 4095;
  if ((*((*((0x20001e68 + r0) << 2)) + 32)) < (r0 + 4095))
  {
    sp = sp + 16;
    r0 = 13;
    return 13;
  }

  r0 = 4294967295;
  *((*((0x20001e68 + r0) << 2)) + 20) = 4294967295;
  *((*((0x20001e68 + r0) << 2)) + 16) = 4294967295;
  r0 = 128;
  *((*((0x20001e68 + r0) << 2)) + 4) = 128;
  cond0 = r5 == 3;
  r0 = (*((0x20001e68 + r0) << 2)) + 104;
  func_0x803cbd0();
  ;
  cond1 = ((*((0x20001e68 + r0) << 2)) + 104) == 1;
  r1 = r6 + 1;
  r0 = *((0x20001e68 + r0) << 2);
  func_0x803d14e();
  ;
  cond2 = (*((0x20001e68 + r0) << 2)) == 0;
  *((*((0x20001e68 + r0) << 2)) + 4) = 0;
  r0 = (*((0x20001e68 + r0) << 2)) + 566;
  func_0x803cbd0();
  ;
  var9 = ((*((0x20001e68 + r0) << 2)) + 566) - 43520;
  r1 = var9 - 85;
  cond3 = (var9 - 85) == 0;
  r0 = (*((0x20001e68 + r0) << 2)) + 56;
  func_0x803cbba();
  ;
  r1 = 0x41615252;
  cond4 = ((*((0x20001e68 + r0) << 2)) + 56) == 0x41615252;
  r0 = (*((0x20001e68 + r0) << 2)) + 540;
  func_0x803cbba();
  ;
  r1 = 0x61417272;
  cond5 = ((*((0x20001e68 + r0) << 2)) + 540) == 0x61417272;
  if (((((cond0 && cond1) && cond2) && cond3) && cond4) && cond5)
  {
    r0 = (*((0x20001e68 + r0) << 2)) + 544;
    func_0x803cbba();
    ;
    *((*((0x20001e68 + r0) << 2)) + 20) = (*((0x20001e68 + r0) << 2)) + 544;
    r0 = (*((0x20001e68 + r0) << 2)) + 548;
    func_0x803cbba();
    ;
    *((*((0x20001e68 + r0) << 2)) + 16) = (*((0x20001e68 + r0) << 2)) + 548;
  }

  *((*((0x20001e68 + r0) << 2)) + 0) = r5;
  r1 = 0x20001e64;
  r0 = *(0x20001e64 + 0);
  r0 = (*(0x20001e64 + 0)) + 1;
  *(0x20001e64 + 0) = (*(0x20001e64 + 0)) + 1;
  *((*((0x20001e68 + r0) << 2)) + 6) = (*(0x20001e64 + 0)) + 1;
  r0 = 0x20018b78;
  *((*((0x20001e68 + r0) << 2)) + 12) = 0x20018b78;
  *((*((0x20001e68 + r0) << 2)) + 24) = 0;
  sp = sp + 16;
  r0 = 0;
  return 0;
}


// TODO stack pointer magic to recover p2
int func_0x803bc38(int p1, int p2, int p3) {
  // sp = sp - 4;
  int * sp[2];

  *(sp + 0) = *(sp + 8);
  if (func_0x803c888(sp) < 0) {
    return 11;
  } else {
    int * var0 = _20001e68[func_0x803c888(sp)];
    if (var0 != 0) { *(var0 + 0) = 0; }

    if ((*(sp + 4)) != 0) { *((*(sp + 4)) + 0) = 0; }

    _20001e68[func_0x803c888(sp)] = *(sp + 4);
    if (p3 != 0) {
      return func_0x803c340(sp + 8, sp + 4, 0);
    } else {
      return 0;
    }
  }
}

int func_0x803d6fc(int ** p1, int ** p2)
{
  /*r4 = p1;*/
  /*r6 = p2;*/
  int r0;
  int r5 = 9;
  if (p1 != 0 && *(p1 + 0) != 0 && *(*(p1 + 0) + 0) != 0 && *(p1 + 4) == *(*(p1 + 0) + 6)) {
      r5 = 0;
  }
  if (r5 != 0) {
    *(p2 + 0) = 0;
  } else {
    *(p2 + 0) = *(p1 + 0);
  }
  
  return r5;
}

void func_0x8030952(int p1, int * p2, int p3) {
  /*r9 = p1;*/
  /*r7 = p2;*/
  /*r8 = p3;*/
  func_0x80306d4();
  if (p3 > 0) {
    func_0x8030540(p1 + 0);
    /*r4 = 0;*/
  }

  func_0x803069c();
}

int func_0x803ba7e(int p1, int * p2, int p3, int p4) {
  func_0x8030952(p3 + 2, p2, p4);
  return 0;
}


int func_0x803d59c(int * p1) {
  /*r4 = p1;*/
  int r5 = 0;
  if (*(p1 + 3) != 0) {
    if (func_0x803ba7e(*(p1 + 1), p1 + 56, *(p1 + 52), 1) != 0) {
      r5 = 1;
    } else {
      if ((*(p1 + 52) - *(p1 + 40)) < *(p1 + 32)) {
        if (*(p1 + 2) == 2) {
          func_0x803ba7e(*(p1 + 1), p1 + 56, *(p1 + 52) + *(p1 + 32), 1);
        }
      }
      return 0;
    }
  }
  return r5;
}

void func_0x80308fc(int p1, _2000a99e_mem * p2, int p3)
{
  /*r6 = r0;*/
  /*r5 = r1;*/
  /*r7 = r2;*/
  int i = 0;
  if (p3 > 0) {
    while (i <= p3) {
      func_0x8030890((p1 + i) << 12, p2 + (i << 12), 4096);
      i++;
    }
  }
  return;
}


int func_0x803ba6a(int p1, _2000a99e_mem * p2, int p3, int p4) {
  func_0x80308fc(p3 + 2, p2, p4);
  return 0;
}


int func_0x803d14e(int * p1, int p2) {
  /*r4 = r0;*/
  /*r5 = r1;*/
  int r6 = 0;
  /*r0 = *(r0 + 52);*/
  if (*(p1 + 52) != p2) {
    if (func_0x803d59c(p1) == 0) {
      if (func_0x803ba6a(*(p1 + 1), p1 + 56, p2, 1) != 0) {
        p2 = -1; //4294967295;
        r6 = 1;
      }
      *(p1 + 52) = p2;
    }
  }
  return r6;
}

int func_0x803cbd0 (unsigned char * p1) {
  return *(p1 + 0) | (*(p1 + 1) << 8);
}

unsigned int  func_0x803cbba(unsigned char * p1) {
  return *(p1 + 0) | *(p1 + 1) << 8 | *(p1 + 2) << 16 | *(p1 + 3) << 24;
}


int func_0x803c790 (int ** p1, int p2) {
  int var0, * var1, var2, * var3, var4, * var5, var6, var7, var8, r6;
  int r5 = p2;
  int * r4 = *(p1 + 0);
  if (p2 >= 2) {
    if (*(*(p1 + 0) + 28) <= p2) { r6 = 1; }
    else {

      int r6 = -1;
      int r7 = 0xFFF ; //4294967295 >> 20;
      switch (*(*(p1 + 0) + 0)) {
        case 1:
          var4 = *(*(p1 + 0)) + 40 + ((p2 + (p2 >> 1)) >> 12);
          if (func_0x803d14e(*(p1 + 0), var4) == 0) {
            var5 = ((p2 + (p2 >> 1)) & 0xfff) + *(p1 + 0);
            /*r8 = (r1 + (r1 >> 1)) + 1;*/
            /*r7 = *(var5 + 56);*/
            var6 = *(*(p1 + 0)) + 40 + (((p2 + (p2 >> 1)) + 1) >> 12);
            if (func_0x803d14e(*(p1 + 0), var6) == 0) {
              var7 = ((p2 + (p2 >> 1)) + 1) & 0xfff;
              var8 = *(var5 + 56) | (*((var7 + *(p1 + 0)) + 56) << 8);
              if (p2 != 1) {
                r6 = var8 >> 4;
              } else {
                r6 = var8 & 0xfff;
              }
            }
          }
          break;
        case 2:
          var2 = *(*(p1 + 0)) + 40 + (p2 >> 11);
          if (func_0x803d14e(*(p1 + 0), var2) == 0) {
            var3 = (0xFFF & (p2 << 1)) + *(p1 + 0);
            r6 = func_0x803cbd0(var3 + 56);
          }
          break;
        case 3:
          var0 = (*((*(p1 + 0)) + 40)) + (p2 >> 10);
          if (func_0x803d14e(*(p1 + 0), var0) == 0) {
            var1 = (0xFFF & (p2 << 2)) + *(p1 + 0);
            r6 = func_0x803cbba(var1 + 56) & (~4026531840);
          }
          break;
        default:
          r6 = 1;
          break;

      }
    }
  } else { r6 = 1; }

  return r6;
}

int func_0x803b054(int * p1, int p2) {
  p2 = p2 - 2;
  if ((*(p1 + 28) - 2) <= (p2 - 2)) {
    return 0;
  } else {
    return *(p1 + 10) + *(p1 + 10) * (p2 - 2);
  }
}

void func_0x803d4d6(int * p1, int p2) {
  *(p1 + 0) = p2;
  *((p1 + 1) + 0) = p2 >> 8;
  *(((p1 + 1) + 1) + 0) = p2 >> 16;
  *(((p1 + 1) + 1) + 1) = p2 >> 24;
  return;
}

void func_0x803d4ea(int * p1, int p2) {
  *(p1 + 0) = p2;
  *((p1 + 1) + 0) = p2 >> 8;
}

int func_0x803d1c2(int *p1, unsigned char p2, int p3)
{
  /*r4 = r0;*/
  /*r5 = r1;*/
  /*r6 = r2;*/
  int r0, r1, r7, r8, r9, sl, fp;
  int var0,*var1,var2,var3,*var4,var5;
  if (p2 >= 2) {
    if (*(p1 + 28) > p2) {
      r0 = *(p1 + 0);
      sl = 1;
      r8 = 4095;
      switch (*(p1 + 0)) {
        case 1:
          var3 = *(p1 + 40) + ((p2 + (p2 >> 1)) >> 12);
          r7 = func_0x803d14e(p1, var3);
          if (r7 == 0) {
            var4 = ((p2 + (p2 >> 1)) & 0xfff) + p1;
            r9 = 3 * p2 + 1;
            int * r0 = var4 + 56;
            if (p2 != 1) {
              /*r1 = *((var4 + 56) + 0);*/
              r1 = *((var4 + 56) + 0) | ((unsigned int) p3 | 0xfffffff0);
            } else {
              r1 = p3;
            }

            *((var4 + 56) + 0) = r1;
            *(p1 + 3) = 1;
            r7 = func_0x803d14e(p1, *(p1 + 40) + ((3 * p2 + 1) >> 12));
            if (r7 == 0) {
              r0 = ((r9 & 0xfff) + p1) + 56;
              if (p2 & 1) {
                r1 = p3 & 0xff0;
              } else {
                r1 = (*((((r9 & 0xfff) + p1) + 56) + 0) & 240) | (p3 & 0xf00);
              }

              *((((r9 & 0xfff) + r0) + 56) + 0) = p2;
              *(p1 + 3) = 1;
            }

            return func_0x803d14e(p1, *(p1 + 40) + (r9 >> 12));
          }
          break;
        case 2:
          r7 = func_0x803d14e(p1, (*(p1 + 40)) + (p2 >> 11));
          if (r7 == 0) {
            func_0x803d4ea(((4095 & (p2 << 1)) + p1) + 56, (unsigned int) p3);
            *(p1 + 3) = 1;
          }
          break;
        case 3:
          r7 = func_0x803d14e(p1, *(p1 + 40) + (p2 >> 10));
          if (r7 == 0) {
            r0 = func_0x803cbba(((4095 & (p2 << 2)) + p1) + 56);
            // TODO: BFI messed up here
            func_0x803d4d6(((4095 & (p2 << 2)) + p1) + 56,  p3 | 0xfffffff0);
            *(p1 + 3) = 1;
          }
          break;
      }
    }
  }

  return r7;

}

void func_0x8021b30() {
  int i = 0;
  while (i < 8) {
    voice_arr[i].a = 0;
    voice_arr[i].e = 0;
    i++;
  }

  func_0x8028114();
  func_0x8022f48();
  _20000f30.f = 255;
  _20000f30.d = func_0x802b9d8() - 1;
  return;
}


void func_0x802bb30(int p1) {
  if (p1 <= 2) {
    _20000f30.e = p1;
    int r0 = func_0x80280b0();
    if (r0 == 0 || r0 == 1 || r0 == 2 || r0 == 3) {
      func_0x80240c0();
    } else {
      func_0x8021b30();
    }
  }
}
int func_0x803b110(int ** p1, int p2) {
  /*r8 = r0;*/
  /*r7 = r1;*/
  /*r5 = *r0;*/
  int r0, r1, r4, r6;
  if (p2 != 0) {
    r0 = func_0x803c790(p1, p2);
    if (r0 > 2) { return 1; }
    if ( r0 == -1 || *(*p1 + 28) > r0 ) { return r0; }
    r6 = p2;
  } else {
    r6 = *(*p1 + 16);
    if (r6 != 0) {
      r0 = *(*p1 + 28);
      if (r0 <= r6) {
        r6 = 1;
      }
    }
  }

  if (*(*p1 + 20) == 0) { return 0; }

  r4 = 0;
  if (r6 == p2) {
    r4 = r6 + 1;
    if (*(*p1 + 28) <= (r6 + 1)) {
      r4 = 2;
    }
  }

  r0 = func_0x803c790(p1, r4);
  if (r0 == 1 || r0 == (-1)) { return r0; }

  if (r0 != 0) {
    if (*(*p1 + 16) >= 2) {
      if (*(*p1 + 28) > *(*p1 + 16)) { 
        r6 = *(*p1 + 16); 
      }
    }
    r4 = 0;
  }

  if (r4 == 0) {
    r4 = r6;
    while (1) {
      r4 = r4 + 1;
      if ((*(*p1 + 28)) <= (r4 + 1)) {
        r4 = 2;
        if (r6 < 2) { return 0; }
      }
      r0 = func_0x803c790(p1, r4);
      if (r0 != 0) {
        if ((r0 == 1) || (r0 == (-1))) { return r0; }
        if (r4 == r6) { return 0; }
      } else { break; }
    }
  }

  r0 = func_0x803d1c2(*p1, r4, -1);
  if ((r0 == 0) && (p2 != 0)) {
    r0 = func_0x803d1c2(r0, p2, r4);
  }

  if (r0 != 0) {
    if (r0 != 1) {
      return 1;
    } else {
      return  -1;
    }
  }

  *(*p1 + 16) = r4;
  if (*(*p1 + 20) <= (*(*p1 + 28) - 2)) {
    r0 = *(*p1 + 20) - 1;
    *(*p1 + 20) = *(*p1 + 20) - 1;
  }

  *(*r0 + 4) = *(*r0 + 4) | 1;
  return r4;
}


int func_0x803baae(int *p1, int p2) {
  /*r4 = p1;*/
  /*r5 = p2;*/
  int ** sp;
  int r0 = func_0x803d6fc(p1, sp);
  int var0, var1, var2, var3, var4, var5;
  int cond0, cond1;
  int ** sp;

  int r1, r5, r6, r7, r9, sl, fp;
  int r8 = r0;
  if (r0 != 0) { int r8 = *(p1 + 17); }
  if (r8 != 0) { return r8; }

  if ((*(p1 + 12) < p2) && ~(*(p1 + 16) & 2)) {
    p2 = *(p1 + 12);
  }

  *(p1 + 20) = 0;
  r9 = 1;
  if (p2 != 0) {
    r6 = *(*(sp + 0) + 10) << 12;
    sl = 2;
    cond0 = (*(p1 + 20)) != 0;
    var0 = (p2 - 1) / (*(*(sp + 0) + 10) << 12);
    var1 = (*(p1 + 20) - 1) / (*(*(sp + 0) + 10) << 12);
    cond1 = var0 >= var1;
    if (cond0 && cond1) {
      var2 = (*(*(sp + 0) + 10) << 12) - 1;
      var3 = (*(p1 + 20) - 1) & (~var2);
      *(p1 + 20) = var3;
      p2 = p2 - var3;
      r1 = *(p1 + 24);
    } else {
      if ((*(p1 + 8)) == 0) {
        r0 = func_0x803b110(p1, 0);
        if (r0 == 1) {
          *(p1 + 17) = 2;
          return 2;
        }
        if (r0 == (-1)) {
          *(p1 + 17) = 1;
          return 1;
        }
        *(p1 + 8) = r1;
      }
      *(p1 + 24) = r1;
    }

    if (r1 != 0) {
      if (p2 > (*(*(sp + 0) + 10) << 12)) {
        while (1) {
          p2 = p2 - r6;
          *(p1 + 20) = (*(p1 + 20)) + r6;
          r0 = *(p1 + 16);
          if (*(p1 + 16) & 2) {
            if (func_0x803b110(p1) == 0) {
              p2 = 0;
              break;
            }
          } else {
            func_0x803c790(p1);
            r1 = p1;
          }

          if (r1 == (-1)) {
            *(p1 + 17) = r9;
            return 1;
          }

          if (r1 <= 1 || *(*(sp + 0) + 28) <= r1) {
            *(p1 + 17) = sl;
            return 2;
          }

          *(p1 + 24) = r1;
          if (p2 <= r6) { break; }
        }

      }

      *(p1 + 20) = (*(p1 + 20)) + p2;
      if (((p2 << 20) >> 20) != 0) {
        if (func_0x803b054(*(sp + 0)) == 0) {
          *(p1 + 17) = 2;
          return 2;
        }
        r7 = r0 + (p2 >> 12);
      }
    }
  }

  if ((*(p1 + 20)) > (*(p1 + 12))) {
    *(p1 + 12) = *(p1 + 20);
    *(p1 + 16) = (*(p1 + 16)) | 64;
  }

  if (((*(p1 + 20) << 20) >> 20) == 0) {
    return r8;
  }

  if (*(p1 + 28) == r7) {
    return r8;
  }

  if ((*(p1 + 16)) & 128) {
    if (func_0x803ba7e(*(*(sp + 0) + 1), p1 + 40) != 0) {
      *(p1 + 17) = r9;
      return 1;
    }
    *(p1 + 16) = (*(p1 + 16)) & 127;
  }

  if (func_0x803ba6a(*(*(sp + 0) + 1), p1 + 40, r7, 1) != 0) {
    *(p1 + 17) = r9;
    return 1;
  }

  *(p1 + 28) = r7;
  return r8;
}

void func_0x803d130(int * p1, int * p2, int p3) {
  if (p3 != 0) {
    while (1) {
      int r3 = *(p2 + 1);
      *(p1 + 1) = *(p2 + 1);
      p3 = p3 - 1;
      if ((p3 - 1) == 0) { break; }
    }
  }

  return;
}

int func_0x803be50(int * p1, int * p2, int p3, int * p4) {
  /*r4 = p1;*/
  /*r8 = p2;*/
  /*r6 = p3;*/
  /*r9 = p4;*/
  int ** sp;
  int r0, r5, sl, fp;
  *p4 = 0;
  int cond1 = func_0x803d6fc(p1, sp) == 0;
  int cond0 = (*(p1 + 17)) == 0;
  if (cond1 || cond0) { return 0; }

  if (~((*(p1 + 16)) & 1)) { return 7; }

  if (p3 > ((*(p1 + 12)) - (*(p1 + 20)))) {
    p3 = (*(p1 + 12)) - (*(p1 + 20));
  }

  if (p3 == 0) { return 0; }

  sl = 1;
  while (1) {
    if (((*(p1 + 20) << 20) >> 20) == 0) {
      int var0 = ((*((*(sp + 0)) + 10)) - 1) & ((*(p1 + 20)) >> 12);
      if (var0 == 0) {
        if ((*(p1 + 20)) == 0) { 
          r0 = *(p1 + 8); 
        }else {
          r0 = func_0x803c790(p1, *(p1 + 24));
        }

        if (r0 < 2) {
          *(p1 + 17) = 2;
          return 2;
        }

        if (r0 == (-1)) {
          *(p1 + 17) = sl;
          return 1;
        }

        *(p1 + 24) = r0;
      }

      func_0x803b054(*(sp + 0), *(p1 + 24));
      if ((*(sp + 0)) == 0) {
        *(p1 + 17) = 2;
        return 2;
      }

      fp = r0 + var0;
      r5 = p3 >> 12;
      if ((p3 >> 12) == 0) {
        if ((*(p1 + 28)) != (r0 + var0)) {
          r0 = *(p1 + 16);
          if ((*(p1 + 16)) & 128) {
            r0 = func_0x803ba7e(*(*(sp + 0)) + 1, p1 + 40, *(p1 + 28) ,1);
            if (r0 != 0) {
              *(p1 + 17) = sl;
              return 1;
            }
            *(p1 + 16) = (*(p1 + 16)) & 127;
          }

          if (func_0x803ba6a(*((*(sp + 0)) + 1), p1 + 40, r0 + var0, 1) == 0) {
            *(p1 + 17) = sl;
            return 1;
          }

        }
        *(p1 + 28) = r0 + var0;
      } else {
        if ((var0 + (p3 >> 12)) > (*((*(sp + 0)) + 10))) {
          r5 = (*((*(sp + 0)) + 10)) - var0;
        }

        // TODO verify if this is bug
        r0 = func_0x803ba6a( *((*(sp + 0)) + 1), p2, r0 + var0, r5 );
        if (r0 != 0) {
          *(p1 + 17) = sl;
          r0 = 1;
          return 1;
        }

        if (~((*(p1 + 16)) & 128)) {
          if (*(p1 + 28) - (r0 + var0) < r5) {
            int * var1 = p2 + ((*(p1 + 28) - (r0 + var0)) << 12);
            func_0x803d130(var1, p1 + 40, 4096);
          }

        }

        p3 = p3 - (r5 << 12);
        *p4 = (*p4) + (r5 << 12);
        
        p2 = p2 + (r5 << 12);
        
        *(p1 + 20) = (*(p1 + 20)) + (r5 << 12);
        if ((p3 - (r5 << 12)) == 0) { break; }
      }
    }

    if ((*(p1 + 20) & 0xfff) - 4096 > p3) { r5 = p3; }

    func_0x803d130(p2, (*(p1 + 20) & 0xfff) + p1 + 40, r5);
    p3 = p3 - r5;
    *p4 = *p4 + r5;
    p2 = p2 + r5;
    *(p1 + 20) = (*(p1 + 20)) + r5;
    if ((p3 - r5) == 0) { break; }
  }
  return 0;
}

int func_0x8030144(int p1, int * p2, int p3) {
  /*r7 = p2;*/
  /*r8 = p3;*/
  int * sp, r0;
  int * var0 = *(p2 + 4) + ((*(sp + 0) - 32) << 4);
  int cond1 = _20001a38.a + *(var0 + 0) < 128;
  int cond0 = _20001a38.b + *(p2 + 1) >= 64;
  if (cond1 && (~cond0)) {
    if ((unsigned int) *(var0 + 0) + 1 > 1) {
      r0 = *(p2 + 4);
      /*var1 = 1 + ((*(sp + 0) - 32) << 3);*/
      /*r6 = *((*(r1 + 4) + var1) << 1);*/
      /*r4 = 0;*/
    }

    _20001a38.a = _20001a38.a + *(p2 + 0);
    //r0 = *(sp + 0);
    //sp = sp + 12;
    return *(sp + 0);
  }
  else {
    /*sp = sp + 12;*/
    return 0;
  }

}

int func_0x80303b8(int p1, int p2, char * p3, int * p4) {
  int * sp;
  if (*(p3 + 0) != 0) {
    while (1) {
      // TODO verify functino return
      func_0x802ff6c(p1, p2);
      if (func_0x8030144(*(p3 + 0), p4, *(sp + 24)) != *(p3 + 0)) {
        return *(p3 + 0);
      }

      int * var0 = (*(p4 + 4)) + (((*(p3 + 0)) - 32) << 4);
      p1 = (unsigned int) (*(var0 + 0) + p1 + 1);
      if (*(p3 + 0) == 0) { break; }
    }
  }
  return *(p3 + 0);
}

void func_0x80279fc() {
  char * str1; // = pc + 32; 
  char * str2; // = pc + 20;
  int * sp;
  if (_20001120.a < 4) {
    *(sp + 0) = 0;
    func_0x802fc34(30, 0, 19, 10);
    if (func_0x802b9cc() != 0) {
      *(sp + 0) = 1;
      func_0x80303b8(30, 1, str1, _20001a18);
    } else {
      *(sp + 0) = 1;
      func_0x80303b8(30, 1, str2, _20001a18);
    }
  }
}
int func_0x8024f30() {
  int * sp;
  *(sp + 0) = 1;
  char * str; // pc + 12;
  return func_0x80303b8(3, 1, str, _20001a18);
}

void func_0x80240c0() {
  // sp = sp - 44;
  int * sp;
  char * str1; // pc + 108
  char * str2; // pc + 104
  char * str3; // pc + 96
  char * str4; // pc + 72
  char * str5; // pc + 76
  char * str6; // pc + 64
  char * str7; // pc + 56
  if (_20001120.d != 0) { func_0x8024f30(); }

  *(sp + 0) = 0;
  func_0x802fc34(50, 0, 30, 10);
  int r0 = func_0x802b9c0();

  switch (r0) {
    case 0:
      func_0x802030c( sp + 32, str1, 0 );
      break;
    case 1:
      func_0x802030c( sp + 32, str2, 0 );
      break;
    case 2:
      func_0x802030c( sp + 32, str3, 0 );
      break;
  }

  r0 = func_0x802b9b4();
  switch (r0) {
    case 0:
      func_0x802030c(sp + 20, str4, 0 );
      break;
    case 1:
      func_0x802030c(sp + 20, str5, 0 );
      break;
    case 2:
      func_0x802030c(sp + 20, str6, 0 );
      break;
  }
  func_0x802030c(sp + 8, str7, (char *) sp + 20); // sp + 32);
  
  *(sp + 0) = 1;
  func_0x80303b8(50, 1, (char *) sp + 8, _20001a18);
  
  func_0x80279fc();
}

void func_0x802ba44(unsigned char p1) {
  if (p1 <= 30) {
    _20000f30.i = p1;
    if (p1 != 0) {
      func_0x8020298();
      unsigned int var0 = (_20000f30.i) / ( 1 + 2* _20000f30.i );
      unsigned int var1 = (_20000f30.i + ( 1 + 2*_20000f30.i )) * var0;
      float var2 = ((float) (var1 - _20000f30.i)) / 10.0;
      int i = 0;
      while (i < 112) {
        float var3 = (var2 / _20000f30.ag[i]) + 1.0;
        float var4 = (float) _2000583c[i] * var3;
        _2000ae4c[i] = (unsigned int) var4;
        i++;
      }
    } else {
      func_0x802054c(&_2000ae4c, &_2000583c, 3584);
    }
  }
}

void func_0x802b978(int p1) {
  if (p1 == 0 || p1 == 1) {
    _20000f30.l = p1;
    int i = 0;
    while (i < 8) {
      _20001fd4[i].a = 0;
      _20001fd4[i].e = 0;
      i++;
    }
    func_0x8028114();
    func_0x8022f48();
    _20000f30.f = 255;
    _20000f30.d = func_0x802b9d8() - 1;
  }
}

void func_0x802b940(int p1) {
  if (p1 == 0 || p1 == 1) {
    _20000f30.m = p1;
    int i = 0;
    while (i < 8) {
      _20001fd4[i].a = 0;
      _20001fd4[i].e = 0;
      i++;
    }
    func_0x8028114();
    func_0x8022f48();
    _20000f30.f = 255;
    _20000f30.d = func_0x802b9d8() - 1;
  }
}

void func_0x802b958(int p1) {
  if (p1 <= 2) {
    _20000f30.n = p1;
    int i = 0;
    while (i < 8) {
      _20001fd4[i].a = 0;
      _20001fd4[i].e = 0;
      i++;
    }
    func_0x8028114();
    func_0x8022f48();
    _20000f30.f = 255;
    _20000f30.d = func_0x802b9d8() - 1;
  }
}

void func_0x802bb6c(int p1) {
  if (p1 <= 1) {
    _20000f30.o = p1;
    int i = 0;
    while (i < 8) {
      _20001fd4[i].a = 0;
      _20001fd4[i].e = 0;
      i++;
    }
    func_0x8028114();
    func_0x8022f48();
    _20000f30.f = 255;
    _20000f30.d = func_0x802b9d8() - 1;
  }
}

void func_0x802f01c(int p1) {
  _20004afc[p1].g = 1;
}

void func_0x802cd38(float p1_in) {
  unsigned int p1 = * (unsigned int *) &p1_in;
  if (p1 - 1174405120 - 1851392 <= 0x1a71000) {
    _2000055c._1 = p1;
    func_0x802f01c(1);
    func_0x802f01c(31);
    func_0x802f01c(32);
    func_0x802f01c(2);
    func_0x802f01c(0);
    func_0x802f01c(30);
  }
}

void func_0x802cd84(float p1_in) {
  unsigned int p1 = * (unsigned int *) &p1_in;
  if ((p1 - 1073741824) - 46661632 <= 0x2d44000) {
    _2000055c._2 = p1;
    func_0x802f01c(1);
    func_0x802f01c(31);
    func_0x802f01c(32);
    func_0x802f01c(2);
    func_0x802f01c(0);
    func_0x802f01c(30);
  }
}
void func_0x8021b80(float p1_in) {
  unsigned int p1 = * (unsigned int *) &p1_in;
  if (p1 - 1140850688 - 7995392 <= 0x3495000) {
    _20000b68._0 = p1;
    func_0x802f01c(15);
    func_0x802f01c(10);
    func_0x802f01c(29);
    func_0x802f01c(24);
  }
}

void func_0x8023de0(float p1_in) {
  unsigned int p1 = * (unsigned int *) &p1_in;
  if (p1 + 0xb995a000 <= 0x1a81c00) {
    _20000b68._1 = p1;
    func_0x802f01c(16);
    func_0x802f01c(11);
    func_0x802f01c(40);
    func_0x802f01c(25);
    func_0x802f01c(18);
    func_0x802f01c(12);
    func_0x802f01c(42);
    func_0x802f01c(26);
  }
}

void func_0x802bd14(int p1) {
  if (p1 <= 11) {
    _20000f30.q = p1;
    func_0x802f01c(48);
    func_0x802f01c(91);
    func_0x802f01c(49);
    func_0x802f01c(66);
    func_0x802f01c(0);
    func_0x802f01c(30);
    func_0x802f01c(79);
    func_0x802f01c(56);
    func_0x802f01c(51);
    func_0x802f01c(54);
    func_0x802f01c(53);
    func_0x802f01c(52);
  }
}

void func_0x802bd70(int p1) {
  if (p1 <= 1) {
    _20000f30.p = p1;
  }
}

void func_0x803231c() {
  func_0x802bb30(_2000a96d[0]);
  func_0x802ba44(_2000a96d[1]);
  func_0x8032030(_2000a96d[2]);
  func_0x802cd38((float) _2000a96d[3] * 1000);
  func_0x802cd84((float) _2000a96d[4] * 100);
  func_0x8030a78((float) _2000a96d[5] * 1000);
  func_0x8030a9c((float) _2000a96d[6] * 100);
  func_0x8021b80((float) _2000a96d[7] * 1000);
  func_0x8023de0((float) _2000a96d[8] * 1000);
  func_0x802b978(_2000a96d[9]);
  func_0x802b940(_2000a96d[10]);
  func_0x802b958(_2000a96d[11]);
  func_0x802bb6c(_2000a96d[12]);
  func_0x8032004(_2000a96d[13]);
  func_0x8030a64(_2000a96d[14]);
  func_0x802bd14(_2000a96d[15]);
  func_0x802bd70(_2000a96d[16]);
}






int func_0x802f708(int patch_number) {
  // sp = sp - 40;
  // pc + 312, pc + 312, pc + 316, pc + 316, pc + 320, pc + 320, pc + 324,
  // pc + 324, pc + 328, pc + 328
  char * bank1, * bank2, * bank3, * bank4, * bank5, * bank6, * bank7, * bank8, * bank9, * bank10;
  char * factory_bank; // = pc + 332;
  char * str1; // pc + 148
  int *sp = 0;
  func_0x8036506(0x40002000, 0);
  if (_20000f28.bank_number < 10) {
    switch (_20000f28.bank_number) {
      case 0:
        func_0x802030c(sp + 8, bank1, 0); // bank1 
        break;
      case 1:
        func_0x802030c(sp + 8, bank2, 0); // bank2 pc + 312
        break;
      case 2:
        func_0x802030c(sp + 8, bank3, 0); // bank3 pc + 316
        break;
      case 3:
        func_0x802030c(sp + 8, bank4, 0); // bank4 pc + 316
        break;
      case 4:
        func_0x802030c(sp + 8, bank5, 0); // bank5 pc + 320
        break;
      case 5:
        func_0x802030c(sp + 8, bank6, 0); // bank6 pc + 320
        break;
      case 6:
        func_0x802030c(sp + 8, bank7, 0); // bank7 pc + 324
        break;
      case 7:
        func_0x802030c(sp + 8, bank8, 0); // bank8 pc + 324
        break;
      case 8:
        func_0x802030c(sp + 8, bank9, 0); // bank9 pc + 328
        break;
      case 9:
        func_0x802030c(sp + 8, bank10, 0); // bank10; pc + 328
        break;
    }
  }
  int factory = 0;
  _20000f28.a = func_0x803bc38(&_200098e4, factory , 1); // factory? pc + 332
  /*r7 = 1;*/
  if (func_0x803bc38(&_200098e4, factory_bank, 1) == 0) {
    _20000f28.b = func_0x803bc84(_200088bc, sp + 8 ,1);
    int cond0 = func_0x803bc84(_200088bc, sp + 8 ,1) == 0;
    if (cond0) {
      func_0x803baae(&_200088bc, (patch_number - 1) * 98);
      func_0x803be50(&_200088bc, &_2000a91c, 81, sp + 4);
      func_0x803baae(&_200088bc, 81 + (98 * (patch_number - 1)));
      func_0x803be50(&_200088bc, &_2000a96d, 17, sp + 4);
      int i = 0;
      while (1) {
        _20004afc[i].e = _2000a91c[i];
        _20004afc[i].f = 2;
        _20004afc[i].g = 1;
        i++;
        if (i >= 81) { break; }

      }
      func_0x803231c(); // &_2000a91c, r1
      func_0x8030890(512000, &_2000a9ca, 384);
      var2 = *((_2000a9ca + ((_20000f28.c) << 7)) + patch_number - 1);
      if (var2 != 255) {
        _20004afc[81].e = var2;
      } else {
        _20004afc[81].e = 0;
      }
      _20004afc[81].f = 2;
      _20004afc[81].g = 1;
    }
    func_0x803bc38(0, str1 , 1);
  }

  _20000f28.e = 1;
  func_0x8036506(0x40002000, 1);
  /*sp = sp + 40;*/
}

void handle_pc(unsigned char * midi_msg) {
  if (func_0x802b908() == 1) {
    unsigned char patch_no = ((*(midi_msg + 1)) & 127) + 1;
    func_0x8032040(); // do something with global state.
    func_0x8031e8c(patch_no); // load patch from flash to ram
    func_0x802f708(patch_no); // load patch
    
    func_0x8032438(0); // goto page 0

    func_0x802ca70(patch_no); // do something again with patch
  }
}

void func_0x802ca70(int patch_number) {
  // sp = sp - 56;
  char * val3;  // pc + 20
  char * val1; //  pc + 68, 
  char * val2; // pc + 64
  int * sp;
  int r0 = func_0x80280b0();
  if (r0 == 0 || r0 == 1 || r0 == 2 || r0 == 3) {
    int cond2 = r0 == 2;
    int cond1 = r0 == 3;
    int cond0 = func_0x8027f30() != 1;
    if (cond2 && cond1 && cond0) { func_0x802030c(sp + 4, val1, val2); } 
    else { func_0x802030c(sp + 4, val2 , patch_number); }

    *(sp + 0) = 0;
    func_0x802fc34(4, 24, 60, 25);
    func_0x8021a9c(sp + 4, 0, 73);
    *(sp + 0) = 1;
    func_0x803040a(r0, 24, sp + 4, 0x20001a20);
  }
}









struct {
  unsigned char a; // 0
  unsigned char b;
  unsigned char c; // 2
  unsigned char d;
  unsigned char e; // 4
  unsigned char f;
  unsigned char g; // 6
  unsigned char h;
  unsigned char i; // 8 // may not exist
  unsigned char j; // 9
  unsigned char k; // 10
  
} _20000b78;


void func_0x8032030(int p1) {
  if ((p1 - 1) < 99) {
    _20000b78.e = p1;
  }
}
void func_0x8028114() {
  func_0x80205d6(0x2000563c,32,150);
  _20000b78.g = 0;
  _20000b78.h = 0;
  _20000b78.j = 0;
  _20000b78.k = 1;
}

int func_0x802b9d8() {
  int r0 = func_0x802b294();
  if (r0 != 2) {
    if (r0 != 1) {
      r0 = _20000f30.j;
      if ( r0 > 8 ) { r0 = 8; }
      return r0;
    } else {
      r0 = _20000f30.j;
      if (r0 != 1) {
        if ((r0 & 1) != 0) {
          return (unsigned int) r0 - 1;
        } else {
          return r0;
        }
      } else {
        return 2;
      }
    }
  } else {
    if (_20000f30.j != 8) {
      return 4;
    } else {
      return 8;
    }
  }
}




void func_0x8030a78(float p1_in) {
  unsigned int p1 = * (unsigned int *) &p1_in;
  if ((p1 - 1174405120) - 1851392 <= 0x1138800) {
    _200000bc._2 = p1;
  }

  return;
}

void func_0x8030a9c(float p1_in)
{
